#include <iostream>

int main() {
  std::cout << "Обмен значений переменных\n";

		int a = 42;
		int b = 153;
		std::cout << "a: " << a << "\n"; /* На экран будет выведено 42 */
		std::cout << "b: " << b << "\n"; /* На экран будет выведено 153 */

		/* Меняем значения */

		a = a + b;  
        b = a - b;  
        a = a - b; 

		std::cout << "a: " << a << "\n"; /* На экран будет выведено 153 */
		std::cout << "b: " << b << "\n"; /* На экран будет выведено 42 */
        std::cout << "Нажмите Enter для продолжения ... ";

		std::cin.get();
		

};